export default function handler(req, res) {
    res.status(200).json(
        {
            "code": "IR",
            "name": "ایران",
            "states": [
                {
                    "code": 8315,
                    "name": "آذربایجان شرقی",
                    "cities": [
                        {
                            "code": 8319,
                            "name": "آبش‌احمد"
                        },
                        {
                            "code": 8320,
                            "name": "آچاچی"
                        },
                        {
                            "code": 8321,
                            "name": "آذرشهر"
                        },
                        {
                            "code": 8322,
                            "name": "آقکند"
                        },
                        {
                            "code": 8316,
                            "name": "اسکو"
                        },
                        {
                            "code": 8317,
                            "name": "اهر"
                        },
                        {
                            "code": 8318,
                            "name": "ایلخچی"
                        },
                        {
                            "code": 8323,
                            "name": "باروق"
                        },
                        {
                            "code": 8324,
                            "name": "باسمنج"
                        },
                        {
                            "code": 8325,
                            "name": "بخشایش"
                        },
                        {
                            "code": 8326,
                            "name": "بستان‌آباد"
                        },
                        {
                            "code": 8327,
                            "name": "بناب"
                        },
                        {
                            "code": 8328,
                            "name": "تبریز"
                        },
                        {
                            "code": 8329,
                            "name": "تسوج"
                        },
                        {
                            "code": 8330,
                            "name": "تیکمه‌داش"
                        },
                        {
                            "code": 8331,
                            "name": "جلفا"
                        },
                        {
                            "code": 8332,
                            "name": "چاراویماق"
                        },
                        {
                            "code": 8333,
                            "name": "خامنه"
                        },
                        {
                            "code": 8334,
                            "name": "خراجو"
                        },
                        {
                            "code": 8335,
                            "name": "خسروشهر"
                        },
                        {
                            "code": 8336,
                            "name": "خواجه"
                        },
                        {
                            "code": 8337,
                            "name": "دوزدوزان"
                        },
                        {
                            "code": 8338,
                            "name": "ذوالبین"
                        },
                        {
                            "code": 8339,
                            "name": "زرنق"
                        },
                        {
                            "code": 8340,
                            "name": "زنوز"
                        },
                        {
                            "code": 8341,
                            "name": "سراب"
                        },
                        {
                            "code": 8342,
                            "name": "سردرود"
                        },
                        {
                            "code": 8343,
                            "name": "سهند"
                        },
                        {
                            "code": 8344,
                            "name": "سیس"
                        },
                        {
                            "code": 8345,
                            "name": "شبستر"
                        },
                        {
                            "code": 8346,
                            "name": "شربیان"
                        },
                        {
                            "code": 8347,
                            "name": "شرفخانه"
                        },
                        {
                            "code": 8348,
                            "name": "شندآباد"
                        },
                        {
                            "code": 8349,
                            "name": "صوفیان"
                        },
                        {
                            "code": 8350,
                            "name": "عجب‌شیر"
                        },
                        {
                            "code": 8351,
                            "name": "قره‌آغاج"
                        },
                        {
                            "code": 8352,
                            "name": "کُشکسرای"
                        },
                        {
                            "code": 8353,
                            "name": "کلیبر"
                        },
                        {
                            "code": 8354,
                            "name": "کوزه‌کنان"
                        },
                        {
                            "code": 8355,
                            "name": "گوگان"
                        },
                        {
                            "code": 8356,
                            "name": "لیلان"
                        },
                        {
                            "code": 8357,
                            "name": "مراغه"
                        },
                        {
                            "code": 8358,
                            "name": "مرند"
                        },
                        {
                            "code": 8359,
                            "name": "ملکان"
                        },
                        {
                            "code": 8360,
                            "name": "ممقان"
                        },
                        {
                            "code": 8361,
                            "name": "مهربان"
                        },
                        {
                            "code": 8362,
                            "name": "میانه"
                        },
                        {
                            "code": 8365,
                            "name": "هادیشهر"
                        },
                        {
                            "code": 8366,
                            "name": "هریس"
                        },
                        {
                            "code": 8367,
                            "name": "هشترود"
                        },
                        {
                            "code": 8368,
                            "name": "هوراند"
                        },
                        {
                            "code": 8363,
                            "name": "وایقان"
                        },
                        {
                            "code": 8364,
                            "name": "ورزقان"
                        },
                        {
                            "code": 8369,
                            "name": "یامچی"
                        }
                    ]
                },
                {
                    "code": 8704,
                    "name": "چهار محال بختیاری",
                    "cities": [
                        {
                            "code": 8706,
                            "name": "آلونی"
                        },
                        {
                            "code": 8705,
                            "name": "اردل"
                        },
                        {
                            "code": 8707,
                            "name": "بروجن"
                        },
                        {
                            "code": 8708,
                            "name": "بلداجی"
                        },
                        {
                            "code": 8709,
                            "name": "جونقان"
                        },
                        {
                            "code": 8710,
                            "name": "چلگرد"
                        },
                        {
                            "code": 8711,
                            "name": "سامان"
                        },
                        {
                            "code": 8712,
                            "name": "سفیددشت"
                        },
                        {
                            "code": 8713,
                            "name": "سودجان"
                        },
                        {
                            "code": 8714,
                            "name": "سورشجان"
                        },
                        {
                            "code": 8715,
                            "name": "شلمزار"
                        },
                        {
                            "code": 8716,
                            "name": "شهرکرد"
                        },
                        {
                            "code": 8717,
                            "name": "فارسان"
                        },
                        {
                            "code": 8718,
                            "name": "فرادنبه"
                        },
                        {
                            "code": 8719,
                            "name": "فرخ‌شهر"
                        },
                        {
                            "code": 8720,
                            "name": "گندمان"
                        },
                        {
                            "code": 8721,
                            "name": "گهرو"
                        },
                        {
                            "code": 8722,
                            "name": "لردگان"
                        },
                        {
                            "code": 8723,
                            "name": "ناغان"
                        },
                        {
                            "code": 8724,
                            "name": "نافچ"
                        },
                        {
                            "code": 8725,
                            "name": "هفشجان"
                        }
                    ]
                },
                {
                    "code": 8282,
                    "name": "آذربایجان غربی",
                    "cities": [
                        {
                            "code": 8286,
                            "name": "آواجیق"
                        },
                        {
                            "code": 8283,
                            "name": "ارومیه"
                        },
                        {
                            "code": 8284,
                            "name": "اشنویه"
                        },
                        {
                            "code": 8285,
                            "name": "ایواوغلی"
                        },
                        {
                            "code": 8287,
                            "name": "باروق"
                        },
                        {
                            "code": 8288,
                            "name": "بازرگان"
                        },
                        {
                            "code": 8289,
                            "name": "بوکان"
                        },
                        {
                            "code": 8290,
                            "name": "پلدشت"
                        },
                        {
                            "code": 8291,
                            "name": "تکاب"
                        },
                        {
                            "code": 8292,
                            "name": "چایپاره"
                        },
                        {
                            "code": 8293,
                            "name": "خوی"
                        },
                        {
                            "code": 8294,
                            "name": "سردشت"
                        },
                        {
                            "code": 8295,
                            "name": "سرو"
                        },
                        {
                            "code": 8296,
                            "name": "سلماس"
                        },
                        {
                            "code": 8297,
                            "name": "سیلوانه"
                        },
                        {
                            "code": 8298,
                            "name": "سیمینه"
                        },
                        {
                            "code": 8299,
                            "name": "سیه‌چشمه"
                        },
                        {
                            "code": 8300,
                            "name": "شاهین‌دژ"
                        },
                        {
                            "code": 8301,
                            "name": "شوط"
                        },
                        {
                            "code": 8302,
                            "name": "فیرورق"
                        },
                        {
                            "code": 8303,
                            "name": "قره ضیاءالدین"
                        },
                        {
                            "code": 8304,
                            "name": "کشاورز"
                        },
                        {
                            "code": 8305,
                            "name": "گردکشانه"
                        },
                        {
                            "code": 8306,
                            "name": "ماکو"
                        },
                        {
                            "code": 8307,
                            "name": "محمدیار"
                        },
                        {
                            "code": 8308,
                            "name": "محمودآباد"
                        },
                        {
                            "code": 8309,
                            "name": "مهاباد"
                        },
                        {
                            "code": 8310,
                            "name": "میاندوآب"
                        },
                        {
                            "code": 8311,
                            "name": "میرآباد"
                        },
                        {
                            "code": 8312,
                            "name": "نالوس"
                        },
                        {
                            "code": 8313,
                            "name": "نقده"
                        },
                        {
                            "code": 8314,
                            "name": "نوشین‌شهر"
                        }
                    ]
                },
                {
                    "code": 8647,
                    "name": "اردبيل",
                    "cities": [
                        {
                            "code": 8650,
                            "name": "آبی‌بیگلو"
                        },
                        {
                            "code": 8648,
                            "name": "اردبیل"
                        },
                        {
                            "code": 8649,
                            "name": "اندبیل"
                        },
                        {
                            "code": 8651,
                            "name": "بیله‌سوار"
                        },
                        {
                            "code": 8652,
                            "name": "پارس‌آباد"
                        },
                        {
                            "code": 8653,
                            "name": "جعفرآباد"
                        },
                        {
                            "code": 8654,
                            "name": "جنگل فندقلو"
                        },
                        {
                            "code": 8655,
                            "name": "خلخال"
                        },
                        {
                            "code": 8656,
                            "name": "عنبران"
                        },
                        {
                            "code": 8657,
                            "name": "گرمی"
                        },
                        {
                            "code": 8658,
                            "name": "گیلوان"
                        },
                        {
                            "code": 8659,
                            "name": "گیوی"
                        },
                        {
                            "code": 8660,
                            "name": "مشگین‌شهر"
                        },
                        {
                            "code": 8661,
                            "name": "نمین"
                        },
                        {
                            "code": 8662,
                            "name": "نیر"
                        },
                        {
                            "code": 8663,
                            "name": "هیر"
                        }
                    ]
                },
                {
                    "code": 8370,
                    "name": "اصفهان",
                    "cities": [
                        {
                            "code": 8376,
                            "name": "آبچوئیه"
                        },
                        {
                            "code": 8377,
                            "name": "آران و بیدگل"
                        },
                        {
                            "code": 8371,
                            "name": "ابریشم"
                        },
                        {
                            "code": 8372,
                            "name": "ابوزیدآباد"
                        },
                        {
                            "code": 8373,
                            "name": "اردستان"
                        },
                        {
                            "code": 8374,
                            "name": "اژیه"
                        },
                        {
                            "code": 8375,
                            "name": "اصفهان"
                        },
                        {
                            "code": 8378,
                            "name": "بادرود"
                        },
                        {
                            "code": 8379,
                            "name": "برف‌انبار"
                        },
                        {
                            "code": 8380,
                            "name": "بهارستان"
                        },
                        {
                            "code": 8381,
                            "name": "تودشک"
                        },
                        {
                            "code": 8382,
                            "name": "تیران"
                        },
                        {
                            "code": 8383,
                            "name": "جوشقان و کامو"
                        },
                        {
                            "code": 8384,
                            "name": "چمگردان"
                        },
                        {
                            "code": 8385,
                            "name": "خالدآباد"
                        },
                        {
                            "code": 8386,
                            "name": "خمینی‌شهر"
                        },
                        {
                            "code": 8387,
                            "name": "خوانسار"
                        },
                        {
                            "code": 8388,
                            "name": "خور"
                        },
                        {
                            "code": 8389,
                            "name": "خوراسگان"
                        },
                        {
                            "code": 8390,
                            "name": "خورزوق"
                        },
                        {
                            "code": 8391,
                            "name": "داران"
                        },
                        {
                            "code": 8392,
                            "name": "دهق"
                        },
                        {
                            "code": 8393,
                            "name": "دیزیچه"
                        },
                        {
                            "code": 8394,
                            "name": "زاغل"
                        },
                        {
                            "code": 8395,
                            "name": "زرین‌شهر"
                        },
                        {
                            "code": 8396,
                            "name": "زیباشهر"
                        },
                        {
                            "code": 8397,
                            "name": "شاهین‌شهر"
                        },
                        {
                            "code": 8398,
                            "name": "شهرضا"
                        },
                        {
                            "code": 8399,
                            "name": "طالخونچه"
                        },
                        {
                            "code": 8400,
                            "name": "فریدون‌شهر"
                        },
                        {
                            "code": 8401,
                            "name": "کاشان"
                        },
                        {
                            "code": 8402,
                            "name": "کمشجه"
                        },
                        {
                            "code": 8404,
                            "name": "کهریزسنگ"
                        },
                        {
                            "code": 8403,
                            "name": "کوهپایه"
                        },
                        {
                            "code": 8405,
                            "name": "گلپایگان"
                        },
                        {
                            "code": 8406,
                            "name": "گل‌دشت"
                        },
                        {
                            "code": 8407,
                            "name": "گل‌شهر"
                        },
                        {
                            "code": 8408,
                            "name": "گوگد"
                        },
                        {
                            "code": 8409,
                            "name": "مبارکه"
                        },
                        {
                            "code": 8410,
                            "name": "محمدآباد"
                        },
                        {
                            "code": 8411,
                            "name": "میمه"
                        },
                        {
                            "code": 8412,
                            "name": "نجف‌آباد"
                        },
                        {
                            "code": 8413,
                            "name": "نطنز"
                        },
                        {
                            "code": 8414,
                            "name": "نوش‌آباد"
                        },
                        {
                            "code": 8415,
                            "name": "نیاسر"
                        },
                        {
                            "code": 8416,
                            "name": "نیک‌آباد"
                        },
                        {
                            "code": 8417,
                            "name": "ورنامخواست"
                        }
                    ]
                },
                {
                    "code": 8418,
                    "name": "البرز",
                    "cities": [
                        {
                            "code": 8420,
                            "name": "آسارا"
                        },
                        {
                            "code": 8419,
                            "name": "اشتهارد"
                        },
                        {
                            "code": 8421,
                            "name": "چهارباغ"
                        },
                        {
                            "code": 8422,
                            "name": "ساوجبلاغ"
                        },
                        {
                            "code": 8423,
                            "name": "طالقان"
                        },
                        {
                            "code": 8424,
                            "name": "کرج"
                        },
                        {
                            "code": 8425,
                            "name": "کمالشهر"
                        },
                        {
                            "code": 8426,
                            "name": "کوهسار"
                        },
                        {
                            "code": 8427,
                            "name": "گرمدره"
                        },
                        {
                            "code": 8428,
                            "name": "ماهدشت"
                        },
                        {
                            "code": 8429,
                            "name": "محمدشهر"
                        },
                        {
                            "code": 8430,
                            "name": "مشکین‌دشت"
                        },
                        {
                            "code": 8431,
                            "name": "نظرآباد"
                        },
                        {
                            "code": 8432,
                            "name": "هشتگرد"
                        }
                    ]
                },
                {
                    "code": 8664,
                    "name": "ايلام",
                    "cities": [
                        {
                            "code": 8666,
                            "name": "آسمان‌آباد"
                        },
                        {
                            "code": 8665,
                            "name": "ایلام"
                        },
                        {
                            "code": 8667,
                            "name": "پهله"
                        },
                        {
                            "code": 8668,
                            "name": "دهلران"
                        },
                        {
                            "code": 8670,
                            "name": "مهران"
                        },
                        {
                            "code": 8669,
                            "name": "موسیان"
                        },
                        {
                            "code": 8671,
                            "name": "میمه"
                        }
                    ]
                },
                {
                    "code": 8672,
                    "name": "بوشهر",
                    "cities": [
                        {
                            "code": 8675,
                            "name": "آب‌پخش"
                        },
                        {
                            "code": 8676,
                            "name": "آبدان"
                        },
                        {
                            "code": 8673,
                            "name": "امام حسن"
                        },
                        {
                            "code": 8674,
                            "name": "اهرم"
                        },
                        {
                            "code": 8677,
                            "name": "برازجان"
                        },
                        {
                            "code": 8678,
                            "name": "بردخون"
                        },
                        {
                            "code": 8679,
                            "name": "بردستان"
                        },
                        {
                            "code": 8680,
                            "name": "بندر بوشهر"
                        },
                        {
                            "code": 8681,
                            "name": "بندر دیر"
                        },
                        {
                            "code": 8682,
                            "name": "بندر دیلم"
                        },
                        {
                            "code": 8683,
                            "name": "بندر ریگ"
                        },
                        {
                            "code": 8684,
                            "name": "بندر کنگان"
                        },
                        {
                            "code": 8685,
                            "name": "بندر گناوه"
                        },
                        {
                            "code": 8686,
                            "name": "بنک"
                        },
                        {
                            "code": 8687,
                            "name": "تنگ ارم"
                        },
                        {
                            "code": 8688,
                            "name": "جم"
                        },
                        {
                            "code": 8689,
                            "name": "چغادک"
                        },
                        {
                            "code": 8690,
                            "name": "خارک"
                        },
                        {
                            "code": 8691,
                            "name": "خورموج"
                        },
                        {
                            "code": 8692,
                            "name": "دالکی"
                        },
                        {
                            "code": 8693,
                            "name": "دلوار"
                        },
                        {
                            "code": 8694,
                            "name": "ریز"
                        },
                        {
                            "code": 8695,
                            "name": "سعدآباد"
                        },
                        {
                            "code": 8696,
                            "name": "شبانکاره"
                        },
                        {
                            "code": 8697,
                            "name": "شنبه"
                        },
                        {
                            "code": 8698,
                            "name": "طاهری"
                        },
                        {
                            "code": 8699,
                            "name": "عسلویه"
                        },
                        {
                            "code": 8700,
                            "name": "کاکی"
                        },
                        {
                            "code": 8701,
                            "name": "کلمه"
                        },
                        {
                            "code": 8702,
                            "name": "نخل تقی"
                        },
                        {
                            "code": 8703,
                            "name": "وحدتیه"
                        }
                    ]
                },
                {
                    "code": 8433,
                    "name": "تهران",
                    "cities": [
                        {
                            "code": 8437,
                            "name": "آبعلی"
                        },
                        {
                            "code": 8434,
                            "name": "ارجمند"
                        },
                        {
                            "code": 8435,
                            "name": "اسلام‌شهر"
                        },
                        {
                            "code": 8436,
                            "name": "اندیشه"
                        },
                        {
                            "code": 8438,
                            "name": "باغستان"
                        },
                        {
                            "code": 8439,
                            "name": "باقرشهر"
                        },
                        {
                            "code": 8440,
                            "name": "پاکدشت"
                        },
                        {
                            "code": 8441,
                            "name": "پردیس"
                        },
                        {
                            "code": 8442,
                            "name": "پیشوا"
                        },
                        {
                            "code": 8443,
                            "name": "تهران"
                        },
                        {
                            "code": 8444,
                            "name": "دربندسر"
                        },
                        {
                            "code": 8445,
                            "name": "دماوند"
                        },
                        {
                            "code": 8446,
                            "name": "رباط‌کریم"
                        },
                        {
                            "code": 8447,
                            "name": "رودهن"
                        },
                        {
                            "code": 8448,
                            "name": "ری"
                        },
                        {
                            "code": 8449,
                            "name": "زردبند"
                        },
                        {
                            "code": 8450,
                            "name": "شاهدشهر"
                        },
                        {
                            "code": 8451,
                            "name": "شریف‌آباد"
                        },
                        {
                            "code": 8452,
                            "name": "شمیرانات"
                        },
                        {
                            "code": 8453,
                            "name": "شهریار"
                        },
                        {
                            "code": 8454,
                            "name": "صالح‌آباد"
                        },
                        {
                            "code": 8455,
                            "name": "صباشهر"
                        },
                        {
                            "code": 8456,
                            "name": "فردوسیه"
                        },
                        {
                            "code": 8457,
                            "name": "فشم"
                        },
                        {
                            "code": 8458,
                            "name": "فیروزکوه"
                        },
                        {
                            "code": 8459,
                            "name": "قدس"
                        },
                        {
                            "code": 8460,
                            "name": "قرچک"
                        },
                        {
                            "code": 8461,
                            "name": "کیلان"
                        },
                        {
                            "code": 8462,
                            "name": "گلستان"
                        },
                        {
                            "code": 8463,
                            "name": "لواسان"
                        },
                        {
                            "code": 8464,
                            "name": "ملارد"
                        },
                        {
                            "code": 8465,
                            "name": "نسیم‌شهر"
                        },
                        {
                            "code": 8466,
                            "name": "نصیرشهر"
                        },
                        {
                            "code": 8467,
                            "name": "وحیدیه"
                        },
                        {
                            "code": 8468,
                            "name": "ورامین"
                        },
                    ]
                },
                {
                    "code": 8738,
                    "name": "خراسان جنوبی",
                    "cities": [
                        {
                            "code": 8741,
                            "name": "آیَسک"
                        },
                        {
                            "code": 8739,
                            "name": "اسفدن"
                        },
                        {
                            "code": 8740,
                            "name": "اسلامیه"
                        },
                        {
                            "code": 8742,
                            "name": "بشرویه"
                        },
                        {
                            "code": 8743,
                            "name": "بیرجند"
                        },
                        {
                            "code": 8744,
                            "name": "خضری دشت بیاض"
                        },
                        {
                            "code": 8745,
                            "name": "درمیان"
                        },
                        {
                            "code": 8746,
                            "name": "سرایان"
                        },
                        {
                            "code": 8747,
                            "name": "سربیشه"
                        },
                        {
                            "code": 8748,
                            "name": "شوسف"
                        },
                        {
                            "code": 8749,
                            "name": "طارق"
                        },
                        {
                            "code": 8750,
                            "name": "فردوس"
                        },
                        {
                            "code": 8751,
                            "name": "قائن"
                        },
                        {
                            "code": 8752,
                            "name": "قائنات"
                        },
                        {
                            "code": 8753,
                            "name": "نهبندان"
                        }
                    ]
                },
                {
                    "code": 8469,
                    "name": "خراسان رضوی",
                    "cities": [
                        {
                            "code": 8470,
                            "name": "انابد"
                        },
                        {
                            "code": 8471,
                            "name": "باجگیران"
                        },
                        {
                            "code": 8472,
                            "name": "باخرز"
                        },
                        {
                            "code": 8473,
                            "name": "بایگ"
                        },
                        {
                            "code": 8474,
                            "name": "بجستان"
                        },
                        {
                            "code": 8475,
                            "name": "بردسکن"
                        },
                        {
                            "code": 8476,
                            "name": "بیدخت"
                        },
                        {
                            "code": 8477,
                            "name": "تایباد"
                        },
                        {
                            "code": 8478,
                            "name": "تربت جام"
                        },
                        {
                            "code": 8479,
                            "name": "تربت حیدریه"
                        },
                        {
                            "code": 8480,
                            "name": "چاپشلو"
                        },
                        {
                            "code": 8481,
                            "name": "چکنه"
                        },
                        {
                            "code": 8482,
                            "name": "چناران"
                        },
                        {
                            "code": 8483,
                            "name": "خرو"
                        },
                        {
                            "code": 8484,
                            "name": "خلیل‌آباد"
                        },
                        {
                            "code": 8485,
                            "name": "داورزن"
                        },
                        {
                            "code": 8486,
                            "name": "دررود"
                        },
                        {
                            "code": 8487,
                            "name": "دولت‌آباد"
                        },
                        {
                            "code": 8488,
                            "name": "رودآب"
                        },
                        {
                            "code": 8489,
                            "name": "سبزوار"
                        },
                        {
                            "code": 8490,
                            "name": "سرخس"
                        },
                        {
                            "code": 8491,
                            "name": "سلامی"
                        },
                        {
                            "code": 8492,
                            "name": "شادمهر"
                        },
                        {
                            "code": 8493,
                            "name": "شاندیز"
                        },
                        {
                            "code": 8494,
                            "name": "طرقبه"
                        },
                        {
                            "code": 8495,
                            "name": "عشق آباد"
                        },
                        {
                            "code": 8496,
                            "name": "فرهادگرد"
                        },
                        {
                            "code": 8497,
                            "name": "فریمان"
                        },
                        {
                            "code": 8498,
                            "name": "فیروزه"
                        },
                        {
                            "code": 8499,
                            "name": "فیض‌آباد"
                        },
                        {
                            "code": 8500,
                            "name": "قاسم‌آباد"
                        },
                        {
                            "code": 8501,
                            "name": "قدمگاه"
                        },
                        {
                            "code": 8502,
                            "name": "قوچان"
                        },
                        {
                            "code": 8503,
                            "name": "کاخک"
                        },
                        {
                            "code": 8504,
                            "name": "کاریز"
                        },
                        {
                            "code": 8505,
                            "name": "کاشمر"
                        },
                        {
                            "code": 8506,
                            "name": "کلات"
                        },
                        {
                            "code": 8507,
                            "name": "گناباد"
                        },
                        {
                            "code": 8508,
                            "name": "مشهد مقدس"
                        },
                        {
                            "code": 8509,
                            "name": "نصرآباد"
                        },
                        {
                            "code": 8510,
                            "name": "نوخندان"
                        },
                        {
                            "code": 8511,
                            "name": "نیشابور"
                        },
                        {
                            "code": 8512,
                            "name": "نیل‌شهر"
                        },
                        {
                            "code": 8513,
                            "name": "همت آباد"
                        }
                    ]
                },
                {
                    "code": 8726,
                    "name": "خراسان شمالی",
                    "cities": [
                        {
                            "code": 8728,
                            "name": "آشخانه"
                        },
                        {
                            "code": 8727,
                            "name": "اسفراین"
                        },
                        {
                            "code": 8729,
                            "name": "بجنورد"
                        },
                        {
                            "code": 8730,
                            "name": "پیش‌قلعه"
                        },
                        {
                            "code": 8731,
                            "name": "حصار گرم‌خان"
                        },
                        {
                            "code": 8732,
                            "name": "درق"
                        },
                        {
                            "code": 8733,
                            "name": "راز"
                        },
                        {
                            "code": 8734,
                            "name": "سنخواست"
                        },
                        {
                            "code": 8735,
                            "name": "شیروان"
                        },
                        {
                            "code": 8736,
                            "name": "صفی‌آباد"
                        },
                        {
                            "code": 8737,
                            "name": "لوجلی"
                        }
                    ]
                },
                {
                    "code": 8514,
                    "name": "خوزستان",
                    "cities": [
                        {
                            "code": 8520,
                            "name": "آبادان"
                        },
                        {
                            "code": 8515,
                            "name": "اروندکنار"
                        },
                        {
                            "code": 8516,
                            "name": "امیدیه"
                        },
                        {
                            "code": 8517,
                            "name": "اندیمشک"
                        },
                        {
                            "code": 8518,
                            "name": "اهواز"
                        },
                        {
                            "code": 8519,
                            "name": "ایذه"
                        },
                        {
                            "code": 8521,
                            "name": "باغ‌ملک"
                        },
                        {
                            "code": 8522,
                            "name": "بندر امام خمینی ره"
                        },
                        {
                            "code": 8523,
                            "name": "بهبهان"
                        },
                        {
                            "code": 8524,
                            "name": "چمران"
                        },
                        {
                            "code": 8525,
                            "name": "حر ریاحی"
                        },
                        {
                            "code": 8526,
                            "name": "خرمشهر"
                        },
                        {
                            "code": 8527,
                            "name": "دزفول"
                        },
                        {
                            "code": 8528,
                            "name": "دشت آزادگان"
                        },
                        {
                            "code": 8529,
                            "name": "رامهرمز"
                        },
                        {
                            "code": 8530,
                            "name": "سوسنگرد"
                        },
                        {
                            "code": 8531,
                            "name": "شادگان"
                        },
                        {
                            "code": 8532,
                            "name": "شوش"
                        },
                        {
                            "code": 8533,
                            "name": "شوشتر"
                        },
                        {
                            "code": 8534,
                            "name": "صیدون"
                        },
                        {
                            "code": 8535,
                            "name": "گتوند"
                        },
                        {
                            "code": 8536,
                            "name": "لالی"
                        },
                        {
                            "code": 8537,
                            "name": "ماهشهر"
                        },
                        {
                            "code": 8538,
                            "name": "مسجد سلیمان"
                        },
                        {
                            "code": 8539,
                            "name": "میانرود"
                        },
                        {
                            "code": 8540,
                            "name": "مینوشهر"
                        },
                        {
                            "code": 8541,
                            "name": "هفتگل"
                        },
                        {
                            "code": 8542,
                            "name": "هندیجان"
                        }
                    ]
                },
                {
                    "code": 8638,
                    "name": "زنجان",
                    "cities": [
                        {
                            "code": 8640,
                            "name": "آب‌بر"
                        },
                        {
                            "code": 8639,
                            "name": "ارمغان‌خانه"
                        },
                        {
                            "code": 8641,
                            "name": "خرمدره"
                        },
                        {
                            "code": 8642,
                            "name": "زنجان"
                        },
                        {
                            "code": 8643,
                            "name": "سجاس"
                        },
                        {
                            "code": 8644,
                            "name": "سهرورد"
                        },
                        {
                            "code": 8645,
                            "name": "قیدار"
                        },
                        {
                            "code": 8646,
                            "name": "ماه‌نشان"
                        }
                    ]
                },
                {
                    "code": 8754,
                    "name": "سمنان",
                    "cities": [
                        {
                            "code": 8756,
                            "name": "آرادان"
                        },
                        {
                            "code": 8755,
                            "name": "ایوانکی"
                        },
                        {
                            "code": 8757,
                            "name": "بسطام"
                        },
                        {
                            "code": 8758,
                            "name": "دامغان"
                        },
                        {
                            "code": 8759,
                            "name": "درجزین"
                        },
                        {
                            "code": 8760,
                            "name": "سرخه"
                        },
                        {
                            "code": 8761,
                            "name": "سمنان"
                        },
                        {
                            "code": 8762,
                            "name": "شاهرود"
                        },
                        {
                            "code": 8763,
                            "name": "شهمیرزاد"
                        },
                        {
                            "code": 8764,
                            "name": "کلاته خیج"
                        },
                        {
                            "code": 8765,
                            "name": "گرمسار"
                        },
                        {
                            "code": 8766,
                            "name": "مجن"
                        },
                        {
                            "code": 8767,
                            "name": "مهدی‌شهر"
                        }
                    ]
                },
                {
                    "code": 8768,
                    "name": "سیستان و بلوچستان",
                    "cities": [
                        {
                            "code": 8769,
                            "name": "ادیمی"
                        },
                        {
                            "code": 8770,
                            "name": "اسپکه"
                        },
                        {
                            "code": 8771,
                            "name": "ایرانشهر"
                        },
                        {
                            "code": 8772,
                            "name": "بزمان"
                        },
                        {
                            "code": 8773,
                            "name": "بمپور"
                        },
                        {
                            "code": 8774,
                            "name": "بنت"
                        },
                        {
                            "code": 8775,
                            "name": "بنجار"
                        },
                        {
                            "code": 8776,
                            "name": "پیشین"
                        },
                        {
                            "code": 8777,
                            "name": "جالق"
                        },
                        {
                            "code": 8778,
                            "name": "چابهار"
                        },
                        {
                            "code": 8779,
                            "name": "خاش"
                        },
                        {
                            "code": 8780,
                            "name": "دوست‌محمد"
                        },
                        {
                            "code": 8781,
                            "name": "راسک"
                        },
                        {
                            "code": 8782,
                            "name": "زابل"
                        },
                        {
                            "code": 8783,
                            "name": "زابلی"
                        },
                        {
                            "code": 8784,
                            "name": "زاهدان"
                        },
                        {
                            "code": 8785,
                            "name": "زهک"
                        },
                        {
                            "code": 8786,
                            "name": "سراوان"
                        },
                        {
                            "code": 8787,
                            "name": "سرباز"
                        },
                        {
                            "code": 8788,
                            "name": "سوران"
                        },
                        {
                            "code": 8789,
                            "name": "فنوج"
                        },
                        {
                            "code": 8790,
                            "name": "قصرقند"
                        },
                        {
                            "code": 8791,
                            "name": "کنارک"
                        },
                        {
                            "code": 8792,
                            "name": "گلمورتی"
                        },
                        {
                            "code": 8793,
                            "name": "محمدآباد"
                        },
                        {
                            "code": 8794,
                            "name": "میرجاوه"
                        },
                        {
                            "code": 8795,
                            "name": "نصرت‌آباد"
                        },
                        {
                            "code": 8796,
                            "name": "نگور"
                        },
                        {
                            "code": 8797,
                            "name": "نوک‌آباد"
                        },
                        {
                            "code": 8798,
                            "name": "نیک‌شهر"
                        }
                    ]
                },
                {
                    "code": 8543,
                    "name": "فارس",
                    "cities": [
                        {
                            "code": 8552,
                            "name": "آباده"
                        },
                        {
                            "code": 8546,
                            "name": "اردکان"
                        },
                        {
                            "code": 8547,
                            "name": "ارسنجان"
                        },
                        {
                            "code": 8548,
                            "name": "استهبان"
                        },
                        {
                            "code": 8549,
                            "name": "اشکنان"
                        },
                        {
                            "code": 8550,
                            "name": "اقلید"
                        },
                        {
                            "code": 8544,
                            "name": "اَهِل"
                        },
                        {
                            "code": 8545,
                            "name": "اِوَز"
                        },
                        {
                            "code": 8551,
                            "name": "ایزدخواست"
                        },
                        {
                            "code": 8553,
                            "name": "باب انار"
                        },
                        {
                            "code": 8554,
                            "name": "بالاده"
                        },
                        {
                            "code": 8555,
                            "name": "بنارویه"
                        },
                        {
                            "code": 8556,
                            "name": "بهمن"
                        },
                        {
                            "code": 8557,
                            "name": "بیرم"
                        },
                        {
                            "code": 8558,
                            "name": "جنت‌شهر"
                        },
                        {
                            "code": 8559,
                            "name": "جهرم"
                        },
                        {
                            "code": 8560,
                            "name": "خاوران"
                        },
                        {
                            "code": 8561,
                            "name": "خرامه"
                        },
                        {
                            "code": 8562,
                            "name": "خشت"
                        },
                        {
                            "code": 8563,
                            "name": "خنج"
                        },
                        {
                            "code": 8564,
                            "name": "خور"
                        },
                        {
                            "code": 8565,
                            "name": "خومه‌زار"
                        },
                        {
                            "code": 8566,
                            "name": "رستم"
                        },
                        {
                            "code": 8567,
                            "name": "سلطان شهر"
                        },
                        {
                            "code": 8568,
                            "name": "سورمق"
                        },
                        {
                            "code": 8569,
                            "name": "سوریان"
                        },
                        {
                            "code": 8570,
                            "name": "ششده"
                        },
                        {
                            "code": 8571,
                            "name": "شهر خنج"
                        },
                        {
                            "code": 8572,
                            "name": "شیراز"
                        },
                        {
                            "code": 8573,
                            "name": "صغاد"
                        },
                        {
                            "code": 8574,
                            "name": "صفاشهر"
                        },
                        {
                            "code": 8575,
                            "name": "علامرودشت"
                        },
                        {
                            "code": 8576,
                            "name": "فسا"
                        },
                        {
                            "code": 8577,
                            "name": "فیروزآباد"
                        },
                        {
                            "code": 8578,
                            "name": "قائمیه"
                        },
                        {
                            "code": 8579,
                            "name": "قطب‌آباد"
                        },
                        {
                            "code": 8580,
                            "name": "قیر"
                        },
                        {
                            "code": 8582,
                            "name": "کازرون"
                        },
                        {
                            "code": 8583,
                            "name": "کامفیروز"
                        },
                        {
                            "code": 8584,
                            "name": "کنارتخته"
                        },
                        {
                            "code": 8581,
                            "name": "کَوار"
                        },
                        {
                            "code": 8585,
                            "name": "گراش"
                        },
                        {
                            "code": 8586,
                            "name": "گله‌دار"
                        },
                        {
                            "code": 8587,
                            "name": "لار"
                        },
                        {
                            "code": 8588,
                            "name": "لامرد"
                        },
                        {
                            "code": 8590,
                            "name": "مرکزی گراش"
                        },
                        {
                            "code": 8591,
                            "name": "مرودشت"
                        },
                        {
                            "code": 8589,
                            "name": "مُهر"
                        },
                        {
                            "code": 8592,
                            "name": "میمند"
                        },
                        {
                            "code": 8593,
                            "name": "نودان"
                        },
                        {
                            "code": 8594,
                            "name": "نورآباد"
                        },
                        {
                            "code": 8595,
                            "name": "نورآباد ممسنی"
                        },
                        {
                            "code": 8596,
                            "name": "نی‌ریز"
                        },
                        {
                            "code": 8597,
                            "name": "وراوی"
                        }
                    ]
                },
                {
                    "code": 8799,
                    "name": "قزوين",
                    "cities": [
                        {
                            "code": 8805,
                            "name": "آبگرم"
                        },
                        {
                            "code": 8806,
                            "name": "آبيك"
                        },
                        {
                            "code": 8807,
                            "name": "آوج"
                        },
                        {
                            "code": 8800,
                            "name": "ارداق"
                        },
                        {
                            "code": 8801,
                            "name": "اسفرورين"
                        },
                        {
                            "code": 8802,
                            "name": "اقباليه"
                        },
                        {
                            "code": 8803,
                            "name": "البرز"
                        },
                        {
                            "code": 8804,
                            "name": "الوند"
                        },
                        {
                            "code": 8808,
                            "name": "بوئين زهرا"
                        },
                        {
                            "code": 8809,
                            "name": "بيدستان"
                        },
                        {
                            "code": 8810,
                            "name": "تاكستان"
                        },
                        {
                            "code": 8811,
                            "name": "خاكعلي"
                        },
                        {
                            "code": 8812,
                            "name": "خرمدشت"
                        },
                        {
                            "code": 8813,
                            "name": "دانسفهان"
                        },
                        {
                            "code": 8814,
                            "name": "رازميان"
                        },
                        {
                            "code": 8815,
                            "name": "سگزآباد"
                        },
                        {
                            "code": 8816,
                            "name": "سيردان"
                        },
                        {
                            "code": 8817,
                            "name": "شال"
                        },
                        {
                            "code": 8818,
                            "name": "شريفيه"
                        },
                        {
                            "code": 8819,
                            "name": "ضياآباد"
                        },
                        {
                            "code": 8820,
                            "name": "قزوين"
                        },
                        {
                            "code": 8821,
                            "name": "كوهين"
                        },
                        {
                            "code": 8822,
                            "name": "محمديه"
                        },
                        {
                            "code": 8823,
                            "name": "محمودآباد نمونه"
                        },
                        {
                            "code": 8824,
                            "name": "معلم كلايه"
                        },
                        {
                            "code": 8825,
                            "name": "نرجه"
                        }
                    ]
                },
                {
                    "code": 8826,
                    "name": "قم",
                    "cities": [
                        {
                            "code": 8830,
                            "name": "جعفریه"
                        },
                        {
                            "code": 8827,
                            "name": "دستجرد"
                        },
                        {
                            "code": 8832,
                            "name": "سلفچگان"
                        },
                        {
                            "code": 8828,
                            "name": "قم"
                        },
                        {
                            "code": 8829,
                            "name": "قنوات"
                        },
                        {
                            "code": 8831,
                            "name": "کهک"
                        }
                    ]
                },
                {
                    "code": 8833,
                    "name": "کردستان",
                    "cities": [
                        {
                            "code": 8834,
                            "name": "بابارشانی"
                        },
                        {
                            "code": 8835,
                            "name": "بانه"
                        },
                        {
                            "code": 8836,
                            "name": "بیجار"
                        },
                        {
                            "code": 8837,
                            "name": "چناره"
                        },
                        {
                            "code": 8838,
                            "name": "دهگلان"
                        },
                        {
                            "code": 8839,
                            "name": "زرینه"
                        },
                        {
                            "code": 8840,
                            "name": "سریش‌آباد"
                        },
                        {
                            "code": 8841,
                            "name": "سقز"
                        },
                        {
                            "code": 8842,
                            "name": "سنندج"
                        },
                        {
                            "code": 8843,
                            "name": "شویشه"
                        },
                        {
                            "code": 8844,
                            "name": "صاحب"
                        },
                        {
                            "code": 8845,
                            "name": "قروه"
                        },
                        {
                            "code": 8846,
                            "name": "مریوان"
                        },
                    ]
                },
                {
                    "code": 8847,
                    "name": "کرمان",
                    "cities": [
                        {
                            "code": 8848,
                            "name": "اختیارآباد"
                        },
                        {
                            "code": 8849,
                            "name": "امین‌شهر"
                        },
                        {
                            "code": 8850,
                            "name": "اندوهجرد"
                        },
                        {
                            "code": 8851,
                            "name": "باغین"
                        },
                        {
                            "code": 8852,
                            "name": "بافت"
                        },
                        {
                            "code": 8853,
                            "name": "بردسیر"
                        },
                        {
                            "code": 8854,
                            "name": "بروات"
                        },
                        {
                            "code": 8855,
                            "name": "بزنجان"
                        },
                        {
                            "code": 8856,
                            "name": "بم"
                        },
                        {
                            "code": 8857,
                            "name": "بهرمان"
                        },
                        {
                            "code": 8858,
                            "name": "پاریز"
                        },
                        {
                            "code": 8859,
                            "name": "جبالبارز"
                        },
                        {
                            "code": 8860,
                            "name": "جوپار"
                        },
                        {
                            "code": 8861,
                            "name": "جیرفت"
                        },
                        {
                            "code": 8862,
                            "name": "چترود"
                        },
                        {
                            "code": 8863,
                            "name": "دهج"
                        },
                        {
                            "code": 8864,
                            "name": "رابر"
                        },
                        {
                            "code": 8865,
                            "name": "راور"
                        },
                        {
                            "code": 8866,
                            "name": "راین"
                        },
                        {
                            "code": 8867,
                            "name": "رفسنجان"
                        },
                        {
                            "code": 8868,
                            "name": "ریحان‌شهر"
                        },
                        {
                            "code": 8869,
                            "name": "زنگی‌آباد"
                        },
                        {
                            "code": 8870,
                            "name": "زیدآباد"
                        },
                        {
                            "code": 8871,
                            "name": "سیرجان"
                        },
                        {
                            "code": 8872,
                            "name": "شهداد"
                        },
                        {
                            "code": 8873,
                            "name": "صفائیه"
                        },
                        {
                            "code": 8874,
                            "name": "فهرج"
                        },
                        {
                            "code": 8875,
                            "name": "کاظم‌آباد"
                        },
                        {
                            "code": 8876,
                            "name": "کرمان"
                        },
                        {
                            "code": 8877,
                            "name": "کوهبنان"
                        },
                        {
                            "code": 8878,
                            "name": "گلزار"
                        },
                        {
                            "code": 8879,
                            "name": "محی‌آباد"
                        },
                        {
                            "code": 8880,
                            "name": "مردهک"
                        },
                        {
                            "code": 8881,
                            "name": "منوجان"
                        },
                        {
                            "code": 8882,
                            "name": "نرماشیر"
                        },
                        {
                            "code": 8883,
                            "name": "نظام‌شهر"
                        },
                        {
                            "code": 8884,
                            "name": "نودژ"
                        },
                        {
                            "code": 8885,
                            "name": "یزدان‌شهر"
                        }
                    ]
                },
                {
                    "code": 8886,
                    "name": "کرمانشاه",
                    "cities": [
                        {
                            "code": 8887,
                            "name": "ازگله"
                        },
                        {
                            "code": 8888,
                            "name": "اسلام‌آباد غرب"
                        },
                        {
                            "code": 8889,
                            "name": "باینگان"
                        },
                        {
                            "code": 8890,
                            "name": "بیستون"
                        },
                        {
                            "code": 8891,
                            "name": "پاوه"
                        },
                        {
                            "code": 8892,
                            "name": "جوانرود"
                        },
                        {
                            "code": 8893,
                            "name": "روانسر"
                        },
                        {
                            "code": 8894,
                            "name": "سرپل ذهاب"
                        },
                        {
                            "code": 8895,
                            "name": "سرمست"
                        },
                        {
                            "code": 8896,
                            "name": "سطر"
                        },
                        {
                            "code": 8897,
                            "name": "سنقر"
                        },
                        {
                            "code": 8898,
                            "name": "سومار"
                        },
                        {
                            "code": 8899,
                            "name": "صحنه"
                        },
                        {
                            "code": 8900,
                            "name": "قصر شیرین"
                        },
                        {
                            "code": 8901,
                            "name": "کرمانشاه"
                        },
                        {
                            "code": 8902,
                            "name": "کنگاور"
                        },
                        {
                            "code": 8903,
                            "name": "کوزران"
                        },
                        {
                            "code": 8904,
                            "name": "گهواره"
                        },
                        {
                            "code": 8905,
                            "name": "گیلانغرب"
                        },
                        {
                            "code": 8906,
                            "name": "میان‌راهان"
                        },
                        {
                            "code": 8907,
                            "name": "نوسود"
                        },
                        {
                            "code": 8908,
                            "name": "هرسین"
                        },
                        {
                            "code": 8909,
                            "name": "هلشی"
                        }
                    ]
                },
                {
                    "code": 8910,
                    "name": "کهگیلویه و بویراحمد",
                    "cities": [
                        {
                            "code": 8928,
                            "name": "آزادشهر"
                        },
                        {
                            "code": 8929,
                            "name": "آق قلا"
                        },
                        {
                            "code": 8926,
                            "name": "انبار آلوم"
                        },
                        {
                            "code": 8927,
                            "name": "اینچه‌بُرون"
                        },
                        {
                            "code": 8930,
                            "name": "بندر ترکمن"
                        },
                        {
                            "code": 8931,
                            "name": "بندر گز"
                        },
                        {
                            "code": 8932,
                            "name": "خان‌ببین"
                        },
                        {
                            "code": 8933,
                            "name": "دلند"
                        },
                        {
                            "code": 8934,
                            "name": "سرخنکلاته"
                        },
                        {
                            "code": 8935,
                            "name": "سیمین‌شهر"
                        },
                        {
                            "code": 8936,
                            "name": "علی‌آباد کتول"
                        },
                        {
                            "code": 8937,
                            "name": "کردکوی"
                        },
                        {
                            "code": 8938,
                            "name": "کلاله"
                        },
                        {
                            "code": 8939,
                            "name": "گالیکش"
                        },
                        {
                            "code": 8940,
                            "name": "گرگان"
                        },
                        {
                            "code": 8941,
                            "name": "گلستان"
                        },
                        {
                            "code": 8942,
                            "name": "گمیشان"
                        },
                        {
                            "code": 8943,
                            "name": "گنبدکاووس"
                        },
                        {
                            "code": 8944,
                            "name": "مینودشت"
                        },
                        {
                            "code": 8945,
                            "name": "نگین‌شهر"
                        },
                        {
                            "code": 8946,
                            "name": "نوکنده"
                        }
                    ]
                },
                {
                    "code": 8925,
                    "name": "گلستان",
                    "cities": [
                        {
                            "code": 9076,
                            "name": "اردکان"
                        },
                    ]
                },
                {
                    "code": 8947,
                    "name": "گیلان",
                    "cities": [
                        {
                            "code": 8952,
                            "name": "آستانه اشرفیه"
                        },
                        {
                            "code": 8948,
                            "name": "احمدسرگوراب"
                        },
                        {
                            "code": 8949,
                            "name": "اسالم"
                        },
                        {
                            "code": 8950,
                            "name": "اطاقور"
                        },
                        {
                            "code": 8951,
                            "name": "املش"
                        },
                        {
                            "code": 8953,
                            "name": "بازارجمعه"
                        },
                        {
                            "code": 8955,
                            "name": "بندر آستارا"
                        },
                        {
                            "code": 8954,
                            "name": "بندر انزلی"
                        },
                        {
                            "code": 8956,
                            "name": "تالش"
                        },
                        {
                            "code": 8957,
                            "name": "توتکابن"
                        },
                        {
                            "code": 8958,
                            "name": "جیرنده"
                        },
                        {
                            "code": 8959,
                            "name": "چابکسر"
                        },
                        {
                            "code": 8960,
                            "name": "چوبر"
                        },
                        {
                            "code": 8961,
                            "name": "خلیفه محله"
                        },
                        {
                            "code": 8962,
                            "name": "رشت"
                        },
                        {
                            "code": 8963,
                            "name": "رضوان‌شهر"
                        },
                        {
                            "code": 8964,
                            "name": "رودبار"
                        },
                        {
                            "code": 8965,
                            "name": "رودبار زیتون"
                        },
                        {
                            "code": 8966,
                            "name": "رودبنه"
                        },
                        {
                            "code": 8967,
                            "name": "شفت"
                        },
                        {
                            "code": 8968,
                            "name": "شلمان"
                        },
                        {
                            "code": 8969,
                            "name": "صومعه سرا"
                        },
                        {
                            "code": 8970,
                            "name": "فومن"
                        },
                        {
                            "code": 8971,
                            "name": "کوچصفهان"
                        },
                        {
                            "code": 8972,
                            "name": "لاهیجان"
                        },
                        {
                            "code": 8973,
                            "name": "لشت نشا"
                        },
                        {
                            "code": 8974,
                            "name": "لنگرود"
                        },
                        {
                            "code": 8975,
                            "name": "لوشان"
                        },
                        {
                            "code": 8976,
                            "name": "لوندویل"
                        },
                        {
                            "code": 8977,
                            "name": "لیسار"
                        },
                        {
                            "code": 8978,
                            "name": "مارلیک"
                        },
                        {
                            "code": 8979,
                            "name": "ماسال"
                        },
                        {
                            "code": 8980,
                            "name": "مرجغل"
                        },
                        {
                            "code": 8981,
                            "name": "منجیل"
                        },
                        {
                            "code": 8983,
                            "name": "هشتپر"
                        },
                        {
                            "code": 8982,
                            "name": "واجارگاه"
                        },
                    ]
                },
                {
                    "code": 8984,
                    "name": "لرستان",
                    "cities": [
                        {
                            "code": 8985,
                            "name": "ازنا"
                        },
                        {
                            "code": 8986,
                            "name": "الشتر"
                        },
                        {
                            "code": 8987,
                            "name": "الیگودرز"
                        },
                        {
                            "code": 8988,
                            "name": "بروجرد"
                        },
                        {
                            "code": 8989,
                            "name": "پل‌دختر"
                        },
                        {
                            "code": 8990,
                            "name": "چالانچولان"
                        },
                        {
                            "code": 8991,
                            "name": "خرم‌آباد"
                        },
                        {
                            "code": 8992,
                            "name": "درب گنبد"
                        },
                        {
                            "code": 8993,
                            "name": "دورود"
                        },
                        {
                            "code": 8994,
                            "name": "زاغه"
                        },
                        {
                            "code": 8995,
                            "name": "سراب‌دوره"
                        },
                        {
                            "code": 8996,
                            "name": "فرزیان"
                        },
                        {
                            "code": 8997,
                            "name": "فیروزآباد"
                        },
                        {
                            "code": 8998,
                            "name": "کونانی"
                        },
                        {
                            "code": 8999,
                            "name": "کوهدشت"
                        },
                        {
                            "code": 9000,
                            "name": "گراب"
                        },
                        {
                            "code": 9001,
                            "name": "معمولان"
                        },
                        {
                            "code": 9002,
                            "name": "نورآباد"
                        },
                        {
                            "code": 9003,
                            "name": "ویسیان"
                        }
                    ]
                },
                {
                    "code": 8598,
                    "name": "مازندران",
                    "cities": [
                        {
                            "code": 8601,
                            "name": "آلاشت"
                        },
                        {
                            "code": 8602,
                            "name": "آمل"
                        },
                        {
                            "code": 8599,
                            "name": "امیرشهر"
                        },
                        {
                            "code": 8600,
                            "name": "ایزدشهر"
                        },
                        {
                            "code": 8603,
                            "name": "بابل"
                        },
                        {
                            "code": 8604,
                            "name": "بابلسر"
                        },
                        {
                            "code": 8605,
                            "name": "بلده"
                        },
                        {
                            "code": 8606,
                            "name": "بهشهر"
                        },
                        {
                            "code": 8607,
                            "name": "پل سفید"
                        },
                        {
                            "code": 8608,
                            "name": "تنکابن"
                        },
                        {
                            "code": 8609,
                            "name": "جویبار"
                        },
                        {
                            "code": 8610,
                            "name": "چالوس"
                        },
                        {
                            "code": 8611,
                            "name": "چمستان"
                        },
                        {
                            "code": 8612,
                            "name": "خلیل‌شهر"
                        },
                        {
                            "code": 8613,
                            "name": "خوش‌رودپی"
                        },
                        {
                            "code": 8614,
                            "name": "دابودشت"
                        },
                        {
                            "code": 8615,
                            "name": "رامسر"
                        },
                        {
                            "code": 8616,
                            "name": "رستمکلا"
                        },
                        {
                            "code": 8617,
                            "name": "رویان"
                        },
                        {
                            "code": 8618,
                            "name": "زرگرمحله"
                        },
                        {
                            "code": 8619,
                            "name": "ساری"
                        },
                        {
                            "code": 8620,
                            "name": "شیرگاه"
                        },
                        {
                            "code": 8621,
                            "name": "فریدون‌کنار"
                        },
                        {
                            "code": 8622,
                            "name": "فریم"
                        },
                        {
                            "code": 8623,
                            "name": "قائم‌شهر"
                        },
                        {
                            "code": 8624,
                            "name": "کلارآباد"
                        },
                        {
                            "code": 8625,
                            "name": "کلاردشت"
                        },
                        {
                            "code": 8626,
                            "name": "کله‌بست"
                        },
                        {
                            "code": 8627,
                            "name": "کوهی‌خیل"
                        },
                        {
                            "code": 8628,
                            "name": "کیاسر"
                        },
                        {
                            "code": 8629,
                            "name": "گتاب"
                        },
                        {
                            "code": 8630,
                            "name": "گرجی‌محله"
                        },
                        {
                            "code": 8631,
                            "name": "گزنک"
                        },
                        {
                            "code": 8632,
                            "name": "گلوگاه"
                        },
                        {
                            "code": 8633,
                            "name": "محمودآباد"
                        },
                        {
                            "code": 8634,
                            "name": "مرزن‌آباد"
                        },
                        {
                            "code": 8635,
                            "name": "مرزیکلا"
                        },
                        {
                            "code": 8636,
                            "name": "نشتارود"
                        },
                        {
                            "code": 8637,
                            "name": "نوشهر"
                        }
                    ]
                },
                {
                    "code": 9004,
                    "name": "مرکزی",
                    "cities": [
                        {
                            "code": 9005,
                            "name": "اراک"
                        },
                        {
                            "code": 9006,
                            "name": "انجدان"
                        },
                        {
                            "code": 9007,
                            "name": "آشتیان"
                        },
                        {
                            "code": 9008,
                            "name": "پرندک"
                        },
                        {
                            "code": 9009,
                            "name": "تفرش"
                        },
                        {
                            "code": 9010,
                            "name": "توره"
                        },
                        {
                            "code": 9011,
                            "name": "خمین"
                        },
                        {
                            "code": 9012,
                            "name": "خنداب"
                        },
                        {
                            "code": 9013,
                            "name": "رازقان"
                        },
                        {
                            "code": 9014,
                            "name": "زاویه"
                        },
                        {
                            "code": 9015,
                            "name": "ساوه"
                        },
                        {
                            "code": 9016,
                            "name": "سنجان"
                        },
                        {
                            "code": 9017,
                            "name": "شازند"
                        },
                        {
                            "code": 9018,
                            "name": "ضامنجان"
                        },
                        {
                            "code": 9019,
                            "name": "غرق‌آباد"
                        },
                        {
                            "code": 9020,
                            "name": "فرمهین"
                        },
                        {
                            "code": 9021,
                            "name": "فیجان"
                        },
                        {
                            "code": 9022,
                            "name": "قورچی‌باشی"
                        },
                        {
                            "code": 9023,
                            "name": "کرهرود"
                        },
                        {
                            "code": 9024,
                            "name": "کمیجان"
                        },
                        {
                            "code": 9025,
                            "name": "مأمونیه"
                        },
                        {
                            "code": 9026,
                            "name": "محلات"
                        },
                        {
                            "code": 9027,
                            "name": "نراق"
                        },
                        {
                            "code": 9028,
                            "name": "نوبران"
                        },
                        {
                            "code": 9029,
                            "name": "نیم‌ور"
                        },
                    ]
                },
                {
                    "code": 9030,
                    "name": "هرمزگان",
                    "cities": [
                        {
                            "code": 9031,
                            "name": "ابوموسی"
                        },
                        {
                            "code": 9032,
                            "name": "بستک"
                        },
                        {
                            "code": 9033,
                            "name": "بندر چارک"
                        },
                        {
                            "code": 9034,
                            "name": "بندر خمیر"
                        },
                        {
                            "code": 9035,
                            "name": "بندر عباس"
                        },
                        {
                            "code": 9036,
                            "name": "بندر لنگه"
                        },
                        {
                            "code": 9038,
                            "name": "پارسیان"
                        },
                        {
                            "code": 9039,
                            "name": "جاسک"
                        },
                        {
                            "code": 9040,
                            "name": "جزیره کیش"
                        },
                        {
                            "code": 9041,
                            "name": "جناح"
                        },
                        {
                            "code": 9042,
                            "name": "حاجی‌آباد"
                        },
                        {
                            "code": 9043,
                            "name": "درگهان"
                        },
                        {
                            "code": 9044,
                            "name": "رودان"
                        },
                        {
                            "code": 9045,
                            "name": "سندرک"
                        },
                        {
                            "code": 9046,
                            "name": "سیریک"
                        },
                        {
                            "code": 9047,
                            "name": "شهر رویدر"
                        },
                        {
                            "code": 9048,
                            "name": "شهر کنگ"
                        },
                        {
                            "code": 9050,
                            "name": "فین"
                        },
                        {
                            "code": 9051,
                            "name": "قشم"
                        },
                        {
                            "code": 9052,
                            "name": "لنگه"
                        },
                        {
                            "code": 9053,
                            "name": "میناب"
                        },
                    ]
                },
                {
                    "code": 9054,
                    "name": "همدان",
                    "cities": [
                        {
                            "code": 9055,
                            "name": "برزول"
                        },
                        {
                            "code": 9056,
                            "name": "بهار"
                        },
                        {
                            "code": 9057,
                            "name": "حسین آباد ناظم"
                        },
                        {
                            "code": 9058,
                            "name": "دانشگاه پیام نور لالجین"
                        },
                        {
                            "code": 9059,
                            "name": "رزن"
                        },
                        {
                            "code": 9060,
                            "name": "زنگنه"
                        },
                        {
                            "code": 9061,
                            "name": "سامن"
                        },
                        {
                            "code": 9062,
                            "name": "صالح‌آباد"
                        },
                        {
                            "code": 9063,
                            "name": "فامنین"
                        },
                        {
                            "code": 9064,
                            "name": "فرسفج"
                        },
                        {
                            "code": 9065,
                            "name": "فیروزان"
                        },
                        {
                            "code": 9066,
                            "name": "قهاوند"
                        },
                        {
                            "code": 9067,
                            "name": "کبود رآهنگ"
                        },
                        {
                            "code": 9068,
                            "name": "گیان"
                        },
                        {
                            "code": 9069,
                            "name": "لالجین"
                        },
                        {
                            "code": 9070,
                            "name": "ملایر"
                        },
                        {
                            "code": 9071,
                            "name": "مهاجران"
                        },
                        {
                            "code": 9072,
                            "name": "نهاوند"
                        },
                        {
                            "code": 9074,
                            "name": "همدان"
                        },
                        {
                            "code": 9073,
                            "name": "ویژه ملایر"
                        },
                    ]
                },
                {
                    "code": 9075,
                    "name": "يزد",
                    "cities": [
                        {
                            "code": 9076,
                            "name": "اردکان"
                        },
                        {
                            "code": 9077,
                            "name": "بافق"
                        },
                        {
                            "code": 9078,
                            "name": "دیهوک"
                        },
                        {
                            "code": 9079,
                            "name": "فردوس"
                        },
                        {
                            "code": 9080,
                            "name": "مروست"
                        },
                        {
                            "code": 9081,
                            "name": "مهردشت"
                        },
                        {
                            "code": 9082,
                            "name": "میبد"
                        },
                        {
                            "code": 9083,
                            "name": "ندوشن"
                        },
                        {
                            "code": 9084,
                            "name": "یزد"
                        },
                    ]
                }
            ]
        }
    )
}